//==================================================
// フィールド周囲にでるエフェクト
// Author: YudaKaito
//==================================================
#ifndef _NUMBER_H_
#define _NUMBER_H_

//**************************************************
// インクルード
//**************************************************
#include "object2D.h"

//**************************************************
// 前方前言　実態はNG　ポインタだけならOK
//**************************************************

//**************************************************
// 定数定義
//**************************************************

//**************************************************
// 構造体定義
//**************************************************

//**************************************************
// クラス
//**************************************************
class CEffectField : public CObject2D
{
public:
	explicit CEffectField(int nPriority = PRIORITY_EFFECT);
	~CEffectField();

	HRESULT Init() override;

	static CEffectField *Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);

private:

};
#endif	// _NUMBER_H_